#include <stdio.h>

/*
โจทย์เงินทอน

รับค่าจำนวนเงินที่ต้องทอน

Input:
เงินที่ต้องทอน (จำนวนเต็ม)

Output:
500: ?
100: ?
50: ?
20: ?
10: ?
5: ?
1: ?
*/

int main() {
    int cash;
    int c_500, c_100, c_50, c_20, c_10, c_5, c_1;

    // input
    scanf("%d", &cash);

    // process
    c_500 = cash / 500; // จำนวนแบงค์ 500 ที่ต้องทอน
    cash -= c_500 * 500;

    c_100 = cash / 100; // จำนวนแบงค์ 100 ที่ต้องทอนฃ
    cash -= c_100 * 100;

    c_50 = cash / 50; // จำนวนแบงค์ 50 ที่ต้องทอน
    cash -= c_50 * 50;

    c_20 = cash / 20; // จำนวนแบงค์ 20 ที่ต้องทอน
    cash -= c_20 * 20;

    c_10 = cash / 10; // จำนวนเหรียญ 10 ที่ต้องทอน
    cash -= c_10 * 10;

    c_5 = cash / 5;  // จำนวนเหรียญ 5 ที่ต้องทอน
    cash -= c_5 *5;

    c_1 = cash;

    // output
    printf("500: %d\n", c_500);
    printf("100: %d\n", c_100);
    printf("50 : %d\n", c_50);
    printf("20 : %d\n", c_20);
    printf("10 : %d\n", c_10);
    printf("5  : %d\n", c_5);
    printf("1  : %d\n", c_1);
}